doc/html/handlers/route.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Route Handler</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="title" content="Route Handler"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2012-10-18 03:24:16 CDT"/>
<meta name="author" content="Jesse Gumm (@jessegumm)"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
<LINK href="../stylesheet.css" rel="stylesheet" type="text/css" />

</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">Route Handler</h1>

<p><a href="../index.html">Getting Started</a> | <a href="../api.html">API</a> | <a href="../elements.html">Elements</a> | <a href="../actions.html">Actions</a> | <a href="../validators.html">Validators</a> | <a href="../handlers.html"><b>Handlers</b></a> | <a href="../config.html">Configuration Options</a> | <a href="../about.html">About</a>
</p>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 Route Handler</a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Route Handler</h2>
<div class="outline-text-2" id="text-1">


<p>
  The route handler determines how requests are handled, either by directing a
  request to a module, or marking a request to be handled by the static files,
  or by marking a request as 404 Not Found.
</p>
<p>
  The default route handler (<code>dynamic_route_handler.erl</code>) also attempts to load
  modules for pages if the modules need to be loaded by the Erlang Virtul
  Machine.
</p>

</div>

<div id="outline-container-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3"></span> Behavior Functions</h3>
<div class="outline-text-3" id="text-1-1">



</div>

<div id="outline-container-1-1-1" class="outline-5">
<h5 id="sec-1-1-1"><span class="section-number-5"></span> <code>init(Config, State)</code></h5>
<div class="outline-text-5" id="text-1-1-1">


<p>
  Initialize the request.  Unlike most handlers, this is basically where most
  of the work of the handler is done.  It should read the path from the request
  bridge, and eventually call <code>wf_context:page_module(Module)</code> to tell Nitrogen
  which module should be handling the request, and in most cases, it should
  also be calling <code>wf_context:path_info(Pathinfo)</code> to set the path<sub>info</sub> so that
  pages can refer to the path.
</p>
<p>
  It's not exactly the "functional style" because it's highly dependent on side
  effects in the code (the <code>wf_context</code> calls).
</p>
<ul>
<li><i>Return Value</i> - <code>{ok, NewState}</code> 
</li>
</ul>


</div>

</div>

<div id="outline-container-1-1-2" class="outline-5">
<h5 id="sec-1-1-2"><span class="section-number-5"></span> <code>finish(Config, State)</code></h5>
<div class="outline-text-5" id="text-1-1-2">


<p>
  Clean up the handler
</p>
<ul>
<li><i>Return Value</i> - <code>{ok, NewState}</code>
</li>
</ul>


</div>
</div>

</div>

<div id="outline-container-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3"></span> Example</h3>
<div class="outline-text-3" id="text-1-2">


<p>
Here is the complete text of the simple passthrough route handler
(found in handlers/passthrough_route_handler.erl)
</p>



<pre class="src src-erlang"><span class="org-preprocessor">-module</span> (passthrough_route_handler).
<span class="org-preprocessor">-behaviour</span> (route_handler).
<span class="org-preprocessor">-include_lib</span> (<span class="org-string">"wf.hrl"</span>).
<span class="org-preprocessor">-export</span> ([
    <span class="org-type">init/2</span>,
    <span class="org-type">finish/2</span>
]).

<span class="org-function-name">init</span>(<span class="org-variable-name">Module</span>, <span class="org-variable-name">State</span>) -&gt;
    <span class="org-comment-delimiter">% </span><span class="org-comment">Some values...</span>
    <span class="org-variable-name">RequestBridge</span> = <span class="org-type">wf_context</span>:<span class="org-type">request_bridge</span>(),
    <span class="org-variable-name">Path</span> = <span class="org-variable-name">RequestBridge</span>:<span class="org-type">path</span>(),

    <span class="org-comment-delimiter">% </span><span class="org-comment">Update the page_context with the path and module.</span>
    <span class="org-type">wf_context</span>:<span class="org-type">page_module</span>(<span class="org-variable-name">Module</span>),
    <span class="org-type">wf_context</span>:<span class="org-type">path_info</span>(<span class="org-variable-name">Path</span>),
    {ok, <span class="org-variable-name">State</span>}.

<span class="org-function-name">finish</span>(<span class="org-variable-name">_Config</span>, <span class="org-variable-name">State</span>) -&gt;
    {ok, <span class="org-variable-name">State</span>}.
</pre>


</div>

</div>

<div id="outline-container-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3"></span> A More Complete Handler</h3>
<div class="outline-text-3" id="text-1-3">


<p>
Here is the complete text of the default route handler for Nitrogen
(found in handlers/dynamic_route_handler.erl). To help direct, I've kept the
comments in the code explaining it along the way.
</p>



<pre class="src src-erlang"><span class="org-preprocessor">-module</span> (dynamic_route_handler).
<span class="org-preprocessor">-behaviour</span> (route_handler).
<span class="org-preprocessor">-include_lib</span> (<span class="org-string">"wf.hrl"</span>).
<span class="org-preprocessor">-export</span> ([
    <span class="org-type">init/2</span>,
    <span class="org-type">finish/2</span>
]).

<span class="org-comment-delimiter">%% </span><span class="org-comment">@doc</span>
<span class="org-comment-delimiter">%% </span><span class="org-comment">dynamic_route_handler looks at the requested path and file extension</span>
<span class="org-comment-delimiter">%% </span><span class="org-comment">to determine how a request should be served. If the request path has no</span>
<span class="org-comment-delimiter">%% </span><span class="org-comment">extension, then it assumes this request should be handled by a Nitrogen</span>
<span class="org-comment-delimiter">%% </span><span class="org-comment">page module that matches the path with slashes converted to underscores.</span>
<span class="org-comment-delimiter">%% </span><span class="org-comment">If no module is found, then it will chop off the last part of the path</span>
<span class="org-comment-delimiter">%% </span><span class="org-comment">(storing it for later access in wf:path_info/0) and try again, repeating</span>
<span class="org-comment-delimiter">%% </span><span class="org-comment">until either a module is found, or there are no more parts to chop. If</span>
<span class="org-comment-delimiter">%% </span><span class="org-comment">a module still can't be found, then the web_404 module is used if defined</span>
<span class="org-comment-delimiter">%% </span><span class="org-comment">by the user, otherwise a 404 is generated internally.</span>
<span class="org-comment-delimiter">%%</span>
<span class="org-comment-delimiter">%% </span><span class="org-comment">Requests for "/" are automatically sent to index.</span>
<span class="org-comment-delimiter">%%</span>
<span class="org-comment-delimiter">%% </span><span class="org-comment">If the request path does have an extension, then it is treated like a request</span>
<span class="org-comment-delimiter">%% </span><span class="org-comment">for a static file. This is delegated back to the HTTP server.</span>

<span class="org-function-name">init</span>(<span class="org-variable-name">_Config</span>, <span class="org-variable-name">State</span>) -&gt;
    <span class="org-comment-delimiter">% </span><span class="org-comment">Get the path...</span>
    <span class="org-variable-name">RequestBridge</span> = <span class="org-type">wf_context</span>:<span class="org-type">request_bridge</span>(),
    <span class="org-variable-name">Path</span> = <span class="org-variable-name">RequestBridge</span>:<span class="org-type">path</span>(),

    <span class="org-comment-delimiter">% </span><span class="org-comment">Convert the path to a module. If there are no routes defined, then just</span>
    <span class="org-comment-delimiter">% </span><span class="org-comment">convert everything without an extension to a module.</span>
    <span class="org-comment-delimiter">% </span><span class="org-comment">Otherwise, look through all routes for the first matching route.</span>
    {<span class="org-variable-name">Module</span>, <span class="org-variable-name">PathInfo</span>} = <span class="org-type">route</span>(<span class="org-variable-name">Path</span>),
    {<span class="org-variable-name">Module1</span>, <span class="org-variable-name">PathInfo1</span>} = <span class="org-type">check_for_404</span>(<span class="org-variable-name">Module</span>, <span class="org-variable-name">PathInfo</span>, <span class="org-variable-name">Path</span>),

    <span class="org-type">wf_context</span>:<span class="org-type">page_module</span>(<span class="org-variable-name">Module1</span>),
    <span class="org-type">wf_context</span>:<span class="org-type">path_info</span>(<span class="org-variable-name">PathInfo1</span>),

    {ok, <span class="org-variable-name">State</span>}.

<span class="org-function-name">finish</span>(<span class="org-variable-name">_Config</span>, <span class="org-variable-name">State</span>) -&gt;
    {ok, <span class="org-variable-name">State</span>}.

<span class="org-comment-delimiter">%%% </span><span class="org-comment">PRIVATE FUNCTIONS %%%</span>

<span class="org-comment-delimiter">% </span><span class="org-comment">First, check if this is a request for the root path. If so</span>
<span class="org-comment-delimiter">% </span><span class="org-comment">then just send it to index.</span>
<span class="org-comment-delimiter">% </span><span class="org-comment">Check if there is an extension, if so, it's static.</span>
<span class="org-comment-delimiter">% </span><span class="org-comment">Otherwise, try to load a module according to each part of the path.</span>
<span class="org-comment-delimiter">% </span><span class="org-comment">First, cycle through code:all_loaded(). If not there, then check erl_prim_loader:get_file()</span>
<span class="org-comment-delimiter">% </span><span class="org-comment">If still not there, then 404.</span>
<span class="org-function-name">route</span>(<span class="org-string">"/"</span>) -&gt;
    {<span class="org-builtin">list_to_atom</span>(<span class="org-type">module_name</span>([<span class="org-string">"index"</span>])), []};

<span class="org-function-name">route</span>(<span class="org-variable-name">Path</span>) -&gt;
    <span class="org-variable-name">IsStatic</span> = (<span class="org-type">filename</span>:<span class="org-type">extension</span>(<span class="org-variable-name">Path</span>) /= []),
    <span class="org-keyword">case</span> <span class="org-variable-name">IsStatic</span> <span class="org-keyword">of</span>
        true -&gt;
            <span class="org-comment-delimiter">% </span><span class="org-comment">Serve this up as a static file.</span>
            {static_file, <span class="org-variable-name">Path</span>};

        false -&gt;
            <span class="org-variable-name">Path1</span> = <span class="org-type">string</span>:<span class="org-type">strip</span>(<span class="org-variable-name">Path</span>, both, <span class="org-constant">$/</span>),
            <span class="org-variable-name">Tokens</span> = <span class="org-type">string</span>:<span class="org-type">tokens</span>(<span class="org-variable-name">Path1</span>, <span class="org-string">"/"</span>),
            <span class="org-comment-delimiter">% </span><span class="org-comment">Check for a loaded module. If not found, then try to load it.</span>
            <span class="org-keyword">case</span> <span class="org-type">try_load_module</span>(<span class="org-variable-name">Tokens</span>) <span class="org-keyword">of</span>
                {<span class="org-variable-name">Module</span>, <span class="org-variable-name">PathInfo</span>} -&gt;
                    {<span class="org-variable-name">Module</span>, <span class="org-variable-name">PathInfo</span>};
                undefined -&gt;
                    {web_404, <span class="org-variable-name">Path1</span>}
            <span class="org-keyword">end</span>
    <span class="org-keyword">end</span>.

<span class="org-function-name">module_name</span>(<span class="org-variable-name">Tokens</span>) -&gt;
    <span class="org-variable-name">ModulePrefix</span> = <span class="org-type">wf</span>:<span class="org-type">config_default</span>(module_prefix, <span class="org-string">""</span>),
        <span class="org-variable-name">AllTokens</span> = <span class="org-keyword">case</span> <span class="org-variable-name">ModulePrefix</span> <span class="org-keyword">of</span>
            <span class="org-string">""</span> -&gt;<span class="org-function-name"> </span><span class="org-variable-name">Tokens</span>;
            <span class="org-variable-name">_</span> -&gt;<span class="org-function-name"> </span>[ <span class="org-variable-name">ModulePrefix</span> | <span class="org-variable-name">Tokens</span> ]
        <span class="org-keyword">end</span>,
        <span class="org-variable-name">_ModuleName</span> = <span class="org-type">string</span>:<span class="org-type">join</span>(<span class="org-variable-name">AllTokens</span>, <span class="org-string">"_"</span>).

<span class="org-function-name">try_load_module</span>(<span class="org-variable-name">Tokens</span>) -&gt;<span class="org-function-name"> </span><span class="org-type">try_load_module</span>(<span class="org-variable-name">Tokens</span>, []).
<span class="org-function-name">try_load_module</span>([], <span class="org-variable-name">_ExtraTokens</span>) -&gt;<span class="org-function-name"> </span>undefined;
<span class="org-function-name">try_load_module</span>(<span class="org-variable-name">Tokens</span>, <span class="org-variable-name">ExtraTokens</span>) -&gt;
    <span class="org-comment-delimiter">%% </span><span class="org-comment">Get the module name...</span>
    <span class="org-variable-name">ModuleName</span> = <span class="org-type">module_name</span>(<span class="org-variable-name">Tokens</span>),
    <span class="org-variable-name">Module</span> = <span class="org-keyword">try</span>
        <span class="org-builtin">list_to_existing_atom</span>(<span class="org-variable-name">ModuleName</span>)
    <span class="org-keyword">catch</span> <span class="org-variable-name">_</span>:<span class="org-variable-name">_</span> -&gt;
        <span class="org-keyword">case</span> <span class="org-type">erl_prim_loader</span>:<span class="org-type">get_file</span>(<span class="org-variable-name">ModuleName</span> ++ <span class="org-string">".beam"</span>) <span class="org-keyword">of</span>
            {ok, <span class="org-variable-name">_</span>, <span class="org-variable-name">_</span>} -&gt;<span class="org-function-name"> </span><span class="org-builtin">list_to_atom</span>(<span class="org-variable-name">ModuleName</span>);
            <span class="org-variable-name">_</span> -&gt;<span class="org-function-name"> </span><span class="org-builtin">list_to_atom</span>(<span class="org-string">"$not_found"</span>)
        <span class="org-keyword">end</span>
    <span class="org-keyword">end</span>,

    <span class="org-comment-delimiter">%% </span><span class="org-comment">Load the module, check if it exports the right method...</span>
    <span class="org-type">code</span>:<span class="org-type">ensure_loaded</span>(<span class="org-variable-name">Module</span>),
    <span class="org-keyword">case</span> <span class="org-builtin">erlang</span>:<span class="org-builtin">function_exported</span>(<span class="org-variable-name">Module</span>, main, 0) <span class="org-keyword">of</span>
        true -&gt;
            <span class="org-variable-name">PathInfo</span> = <span class="org-type">string</span>:<span class="org-type">join</span>(<span class="org-variable-name">ExtraTokens</span>, <span class="org-string">"/"</span>),
            {<span class="org-variable-name">Module</span>, <span class="org-variable-name">PathInfo</span>};
        false -&gt;
            <span class="org-type">next_try_load_module</span>(<span class="org-variable-name">Tokens</span>, <span class="org-variable-name">ExtraTokens</span>)
    <span class="org-keyword">end</span>.


<span class="org-function-name">next_try_load_module</span>(<span class="org-variable-name">Tokens</span>, <span class="org-variable-name">ExtraTokens</span>) -&gt;
    <span class="org-variable-name">Tokens1</span> = <span class="org-type">lists</span>:<span class="org-type">reverse</span>(<span class="org-builtin">tl</span>(<span class="org-type">lists</span>:<span class="org-type">reverse</span>(<span class="org-variable-name">Tokens</span>))),
    <span class="org-variable-name">ExtraTokens1</span> = [<span class="org-builtin">hd</span>(<span class="org-type">lists</span>:<span class="org-type">reverse</span>(<span class="org-variable-name">Tokens</span>))|<span class="org-variable-name">ExtraTokens</span>],
    <span class="org-type">try_load_module</span>(<span class="org-variable-name">Tokens1</span>, <span class="org-variable-name">ExtraTokens1</span>).

<span class="org-function-name">check_for_404</span>(static_file, <span class="org-variable-name">_PathInfo</span>, <span class="org-variable-name">Path</span>) -&gt;
    {static_file, <span class="org-variable-name">Path</span>};

<span class="org-function-name">check_for_404</span>(<span class="org-variable-name">Module</span>, <span class="org-variable-name">PathInfo</span>, <span class="org-variable-name">Path</span>) -&gt;
    <span class="org-comment-delimiter">% </span><span class="org-comment">Make sure the requested module is loaded. If it</span>
    <span class="org-comment-delimiter">% </span><span class="org-comment">is not, then try to load the web_404 page. If that</span>
    <span class="org-comment-delimiter">% </span><span class="org-comment">is not available, then default to the 'file_not_found_page' module.</span>
    <span class="org-keyword">case</span> <span class="org-type">code</span>:<span class="org-type">ensure_loaded</span>(<span class="org-variable-name">Module</span>) <span class="org-keyword">of</span>
        {module, <span class="org-variable-name">Module</span>} -&gt;<span class="org-function-name"> </span>{<span class="org-variable-name">Module</span>, <span class="org-variable-name">PathInfo</span>};
        <span class="org-variable-name">_</span> -&gt;
            <span class="org-keyword">case</span> <span class="org-type">code</span>:<span class="org-type">ensure_loaded</span>(web_404) <span class="org-keyword">of</span>
                {module, web_404} -&gt;<span class="org-function-name"> </span>{web_404, <span class="org-variable-name">Path</span>};
                <span class="org-variable-name">_</span> -&gt;<span class="org-function-name"> </span>{file_not_found_page, <span class="org-variable-name">Path</span>}
            <span class="org-keyword">end</span>
    <span class="org-keyword">end</span>.

</pre>



</div>

</div>

<div id="outline-container-1-4" class="outline-3">
<h3 id="sec-1-4"><span class="section-number-3"></span> See Also</h3>
<div class="outline-text-3" id="text-1-4">


<ul>
<li><a href="../handlers.html">Handler Overview</a>

</li>
<li><a href="../api.html#sec-10">Web Request and Response</a> - Scroll down a bit to the
      <code>wf:page_info</code> options.
</li>
</ul>

</div>
</div>
</div>
</div>

<div id="postamble">
<p class="date">Date: 2012-10-18 03:24:16 CDT</p>
<p class="author">Author: Jesse Gumm (@jessegumm)</p>
<p class="creator">Org version 7.8.02 with Emacs version 23</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div><h2>Comments</h2>
<b>Note:</b><!-- Disqus does not currently support Erlang for its syntax highlighting, so t-->To specify <!--Erlang--> code blocks, just use the generic code block syntax: <pre><b>&lt;pre&gt;&lt;code&gt;your code here&lt;/code&gt;&lt;/pre&gt;</b></pre>
<br />
<br />
<div id="disqus_thread"></div>
<script type="text/javascript">
	/* * * CONFIGURATION VARIABLES: EDIT BEFORE PASTING INTO YOUR WEBPAGE * * */
	var disqus_shortname = 'nitrogenproject'; // required: replace example with your forum shortname
	var disqus_identifier = 'html/handlers/route.html'; //This will be replaced with the path part of the url

	/* * * DON'T EDIT BELOW THIS LINE * * */
	(function() {
		var dsq = document.createElement('script'); dsq.type = 'text/javascript'; dsq.async = true;
		dsq.src = 'http://' + disqus_shortname + '.disqus.com/embed.js';
		(document.getElementsByTagName('head')[0] || document.getElementsByTagName('body')[0]).appendChild(dsq);
	})();
</script>
<noscript>Please enable JavaScript to view the <a href="http://disqus.com/?ref_noscript">comments powered by Disqus.</a></noscript>
<a href="http://disqus.com" class="dsq-brlink">comments powered by <span class="logo-disqus">Disqus</span></a>
</body>
</html>
